In [1]:
!pip install pysqlite3

Collecting pysqlite3
  Using cached pysqlite3-0.5.4.tar.gz (40 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (pyproject.toml): started
  Building wheel for pysqlite3 (pyproject.toml): finished with status 'error'
Failed to build pysqlite3

  error: subprocess-exited-with-error

  × Building wheel for pysqlite3 (pyproject.toml) did not run successfully.
  │ exit code: 1
  ╰─> [23 lines of output]
      C:\Users\nagor\AppData\Local\Temp\pip-build-env-4zn18zqd\overlay\Lib\site-packages\setuptools\dist.py:759: SetuptoolsDeprecationWarning: License classifiers are deprecated.
      !!

              ********************************************************************************
              Please consider removing the following classifiers in favor of a SPDX license expression:

              License :: OSI Approved :: zlib/libpng License

              See https://packaging.python.org/en/latest/guides/writing-pyproject-toml/#license for details.
              ********************************************************************************

      !!
        self._finalize_license_expression()
      running bdist_wheel
      running build
      running build_py
      creating build\lib.win-amd64-cpython-311\pysqlite3
      copying pysqlite3\dbapi2.py -> build\lib.win-amd64-cpython-311\pysqlite3
      copying pysqlite3\__init__.py -> build\lib.win-amd64-cpython-311\pysqlite3
      running build_ext
      Builds a C extension linking against libsqlite3 library
      building 'pysqlite3._sqlite3' extension
      error: Microsoft Visual C++ 14.0 or greater is required. Get it with "Microsoft C++ Build Tools": https://visualstudio.microsoft.com/visual-cpp-build-tools/
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
  ERROR: Failed building wheel for pysqlite3
ERROR: Could not build wheels for pysqlite3, which is required to install pyproject.toml-based projects

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import sqlite3

In [3]:
import os
os.getcwd()

'c:\\Users\\nagor\\Documents\\Thebridge\\2503_dsft_thebridge_nagore\\2-Data_Analysis\\8-BBDD\\SQL\\Practica\\1-Chinook\\data'

In [4]:
import os
print(os.path.exists(r"C:\Users\nagor\Documents\Thebridge\2503_dsft_thebridge_nagore\2-Data_Analysis\8-BBDD\SQL\Practica\1-Chinook\data\chinook.db"))

True

In [5]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect(r"C:\Users\nagor\Documents\Thebridge\2503_dsft_thebridge_nagore\2-Data_Analysis\8-BBDD\SQL\Practica\1-Chinook/data/chinook.db")  #asi le pasamos el fichero y se conecta

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [6]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):  #coje el cursor cmo vaiable global y a través de ese cursos sabe donde hacer esa pregunta

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

Puedes ver todas las tablas que hay en la base de datos con la siguiente sentencia

In [7]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

albums
sqlite_sequence
artists
customers
employees
genres
invoices
invoice_items
media_types
playlists
playlist_track
tracks
sqlite_stat1
films

In [8]:
#obten los clientes de Brasil

query = '''
SELECT * FROM CUSTOMERS
WHERE Country = "Brazil"
'''
sql_query(query)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [9]:
# Obtén los empleados que son agentes de ventas
query = '''
SELECT * FROM Employees
WHERE title = "Sales Support Agent" or title = "Sales Manager"
'''
sql_query(query)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,2,Edwards,Nancy,Sales Manager,1,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
1,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
2,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
3,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [10]:
# Obtén las canciones de ‘AC/DC
query = '''
SELECT DISTINCT Name FROM Artists;
'''
sql_query(query)

                                                  Name
0                                                AC/DC
1                                               Accept
2                                            Aerosmith
3                                    Alanis Morissette
4                                      Alice In Chains
..                                                 ...
270   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
271                             Emerson String Quartet
272  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273                                      Nash Ensemble
274                              Philip Glass Ensemble

[275 rows x 1 columns]

In [11]:
query = '''
SELECT * FROM tracks
WHERE composer = 'AC/DC'
'''
sql_query(query)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,15,Go Down,4,1,1,AC/DC,331180,10847611,0.99
1,16,Dog Eat Dog,4,1,1,AC/DC,215196,7032162,0.99
2,17,Let There Be Rock,4,1,1,AC/DC,366654,12021261,0.99
3,18,Bad Boy Boogie,4,1,1,AC/DC,267728,8776140,0.99
4,19,Problem Child,4,1,1,AC/DC,325041,10617116,0.99
5,20,Overdose,4,1,1,AC/DC,369319,12066294,0.99
6,21,Hell Ain't A Bad Place To Be,4,1,1,AC/DC,254380,8331286,0.99
7,22,Whole Lotta Rosie,4,1,1,AC/DC,323761,10547154,0.99

In [14]:
# Obtén los campos de los clientes que no sean de USA: Nombre completo, ID, País
query = '''SELECT CustomerId, FirstName || ' ' || LastName, Country FROM customers
WHERE Country <> "USA"'''
sql_query(query)

    CustomerId FirstName || ' ' || LastName         Country
0            1               Luís Gonçalves          Brazil
1            2                Leonie Köhler         Germany
2            3            François Tremblay          Canada
3            4                 Bjørn Hansen          Norway
4            5        František Wichterlová  Czech Republic
5            6                  Helena Holý  Czech Republic
6            7                Astrid Gruber         Austria
7            8                 Daan Peeters         Belgium
8            9                 Kara Nielsen         Denmark
9           10              Eduardo Martins          Brazil
10          11              Alexandre Rocha          Brazil
11          12              Roberto Almeida          Brazil
12          13               Fernanda Ramos          Brazil
13          14                 Mark Philips          Canada
14          15            Jennifer Peterson          Canada
15          29                 Robert Brown          Canada
16          30               Edward Francis          Canada
17          31                  Martha Silk          Canada
18          32               Aaron Mitchell          Canada
19          33               Ellie Sullivan          Canada
20          34               João Fernandes        Portugal
21          35             Madalena Sampaio        Portugal
22          36             Hannah Schneider         Germany
23          37              Fynn Zimmermann         Germany
24          38              Niklas Schröder         Germany
25          39              Camille Bernard          France
26          40           Dominique Lefebvre          France
27          41                  Marc Dubois          France
28          42                 Wyatt Girard          France
29          43             Isabelle Mercier          France
30          44             Terhi Hämäläinen         Finland
31          45              Ladislav Kovács         Hungary
32          46                Hugh O'Reilly         Ireland
33          47                Lucas Mancini           Italy
34          48        Johannes Van der Berg     Netherlands
35          49             Stanisław Wójcik          Poland
36          50                Enrique Muñoz           Spain
37          51             Joakim Johansson          Sweden
38          52                   Emma Jones  United Kingdom
39          53                  Phil Hughes  United Kingdom
40          54                 Steve Murray  United Kingdom
41          55                  Mark Taylor       Australia
42          56              Diego Gutiérrez       Argentina
43          57                   Luis Rojas           Chile
44          58                 Manoj Pareek           India
45          59              Puja Srivastava           India

In [15]:
# Obtén los empleados que son agentes de ventas: Nombre completo, Dirección(Ciudad, Estado, País) y email

query = '''
SELECT DISTINCT * FROM Employees;
'''
sql_query(query)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [16]:
query = '''
SELECT FirstName, LastName, Address, City, State, Country, Email FROM Employees
WHERE title = "Sales Support Agent" or title = "Sales Manager"
'''
sql_query(query)

,FirstName,LastName,Address,City,State,Country,Email
0,Nancy,Edwards,825 8 Ave SW,Calgary,AB,Canada,nancy@chinookcorp.com
1,Jane,Peacock,1111 6 Ave SW,Calgary,AB,Canada,jane@chinookcorp.com
2,Margaret,Park,683 10 Street SW,Calgary,AB,Canada,margaret@chinookcorp.com
3,Steve,Johnson,7727B 41 Ave,Calgary,AB,Canada,steve@chinookcorp.com

In [17]:
# Obtén una lista con los países no repetidos a los que se han emitido facturas
query = '''
SELECT DISTINCT BillingCity FROM invoices;
'''

sql_query(query)

            BillingCity
0             Stuttgart
1                  Oslo
2              Brussels
3              Edmonton
4                Boston
5             Frankfurt
6                Berlin
7                 Paris
8              Bordeaux
9                Dublin
10               London
11        Mountain View
12              Redmond
13            Cupertino
14                 Reno
15              Madison
16              Halifax
17           Edinburgh
18               Sidney
19             Santiago
20            Bangalore
21            São Paulo
22          Yellowknife
23               Lisbon
24            Amsterdam
25       Rio de Janeiro
26             Brasília
27            Vancouver
28               Tucson
29               Madrid
30            Stockholm
31               Prague
32              Toronto
33               Ottawa
34             Winnipeg
35             Helsinki
36           Copenhagen
37                 Rome
38               Warsaw
39           Fort Worth
40       Salt Lake City
41               Vienne
42                Dijon
43             Budapest
44              Orlando
45              Chicago
46  São José dos Campos
47             Montréal
48                 Lyon
49             New York
50         Buenos Aires
51                Delhi
52                Porto

In [29]:
# Obtén una lista con los estados de USA no repetidos de donde son los clientes y cuántos clientes en cada uno

# COUNT(*) AS NumClientes → Contamos cuántos clientes hay en cada estado y lo renombramos
query = '''
SELECT State, COUNT(*)
FROM Customers
WHERE Country = 'USA'
GROUP BY State;
'''
sql_query(query)  #group by ayuda a agruparlos y que COUNT funcione correctamente

   State  COUNT(*)
0     AZ         1
1     CA         3
2     FL         1
3     IL         1
4     MA         1
5     NV         1
6     NY         1
7     TX         1
8     UT         1
9     WA         1
10    WI         1

In [43]:
# Cuántos artículos tiene la factura 37
query= '''SELECT InvoiceId, COUNT (*) AS Quantity FROM invoice_items
WHERE InvoiceId = 37 
'''

sql_query(query)

   InvoiceId  Quantity
0         37         4

In [35]:
# Cuántas canciones tiene ‘AC/DC’
query = '''
SELECT DISTINCT COUNT(Name) FROM tracks
WHERE composer = 'AC/DC'
'''
sql_query(query)

   COUNT(Name)
0            8

In [ ]:
# Cuántos artículos tiene cada factura
query= '''SELECT InvoiceId, COUNT(*) FROM invoice_items
GROUP BY InvoiceId;
'''
sql_query(query)

     InvoiceId  COUNT(*)
0            1         2
1            2         4
2            3         6
3            4         9
4            5        14
..         ...       ...
407        408         4
408        409         6
409        410         9
410        411        14
411        412         1

[412 rows x 2 columns]

In [40]:
# Cuántas facturas hay de cada país
query = ''' 
SELECT BillingCountry, COUNT (BillingCountry) FROM invoices AS I
GROUP BY BillingCountry
'''
sql_query(query)

    BillingCountry  COUNT (BillingCountry)
0        Argentina                       7
1        Australia                       7
2          Austria                       7
3          Belgium                       7
4           Brazil                      35
5           Canada                      56
6            Chile                       7
7   Czech Republic                      14
8          Denmark                       7
9          Finland                       7
10          France                      35
11         Germany                      28
12         Hungary                       7
13           India                      13
14         Ireland                       7
15           Italy                       7
16     Netherlands                       7
17          Norway                       7
18          Poland                       7
19        Portugal                      14
20           Spain                       7
21          Sweden                       7
22             USA                      91
23  United Kingdom                      21

In [42]:
# Cuántas facturas ha habido en 2009 y 2011

query = ''' SELECT DISTINCT * FROM invoices'''
sql_query(query)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86
...,...,...,...,...,...,...,...,...,...
407,408,25,2013-12-05 00:00:00,319 N. Frances Street,Madison,WI,USA,53703,3.96
408,409,29,2013-12-06 00:00:00,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,5.94
409,410,35,2013-12-09 00:00:00,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,8.91
410,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86
411,412,58,2013-12-22 00:00:00,"12,Community Centre",Delhi,None,India,110017,1.99

In [44]:
query = '''SELECT strftime("%Y", InvoiceDate) AS YEAR, COUNT(*) AS TOTAL_CLIENTS FROM invoices
WHERE (strftime("%Y", InvoiceDate) = "2009") or (strftime("%Y", InvoiceDate) = "2011")
GROUP BY YEAR'''

sql_query(query)

   YEAR  TOTAL_CLIENTS
0  2009             83
1  2011             83

In [49]:
# Cuántas facturas ha habido entre 2009 y 2011
query = '''SELECT strftime("%Y", InvoiceDate) AS YEAR, COUNT(*) AS TOTAL_CLIENTS FROM invoices
WHERE strftime("%Y", InvoiceDate) between  "2009" AND "2011"
GROUP BY YEAR;''' 

sql_query(query)

   YEAR  TOTAL_CLIENTS
0  2009             83
1  2010             83
2  2011             83

In [50]:
# Cuántas clientes hay de España y de Brasil

query = ''' 
SELECT Country, COUNT(CustomerId) AS Numclients FROM customers
WHERE Country IN('Spain' , 'Brazil') 
GROUP BY Country
'''
sql_query(query)

  Country  Numclients
0  Brazil           5
1   Spain           1

In [51]:
# Obtén las canciones que su título empieza por ‘You’
# LIKE 'You%' → Busca nombres que comiencen con "You".

query= '''
SELECT Name AS Titulo FROM tracks
WHERE Name LIKE 'You%'
'''

sql_query(query)

                                           Titulo
0                                 You Oughta Know
1                                       You Learn
2                     You Oughta Know (Alternate)
3                              Your Time Has Come
4                                    You Shook Me
5                                 You Shook Me(2)
6                                 You Fool No One
7             You Fool No One (Alternate Version)
8                              You Keep On Moving
9   You Can't Do it Right (With the One You Love)
10                                   You're Crazy
11                            You Ain't the First
12                              You Could Be Mine
13                You've Got Another Thing Comin'
14                                   You Shook Me
15                        Your Time Is Gonna Come
16                 You've Been A Long Time Coming
17   You're What's Happening (In The World Today)
18                          You Sure Love To Ball
19                                 Your Blue Room
20                                        You Are
21                          You're My Best Friend
22                         You Are The Everything
23                                  You've Got It
24                                    Your Mirror
25                             You Got Me Rocking
26                             You Got Me Rocking
27                             You Better You Bet
28                              You Really Got Me
29                               You Got No Right
30               You're Gonna Break My Hart Again
31                        Your Time Is Gonna Come
32                                    Your Savior
33                                Your Soul Today
34                               You Know My Name
35                           You Know I'm No Good
36  You Know I'm No Good (feat. Ghostface Killah)
37                    You Sent Me Flying / Cherry

In [52]:
# Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

query = ''' 
SELECT c.FirstName || ' ' || c.LastName AS NombreCliente, 
i. InvoiceDate, i. invoiceId, i.BillingCountry 
FROM invoices i
JOIN customers c ON i.CustomerId = c.CustomerId
WHERE i.BillingCountry = 'Brazil'
'''

sql_query(query)

      NombreCliente          InvoiceDate  InvoiceId BillingCountry
0   Eduardo Martins  2009-04-09 00:00:00         25         Brazil
1   Roberto Almeida  2009-05-23 00:00:00         34         Brazil
2    Fernanda Ramos  2009-06-05 00:00:00         35         Brazil
3   Alexandre Rocha  2009-09-06 00:00:00         57         Brazil
4    Fernanda Ramos  2009-09-07 00:00:00         58         Brazil
5   Alexandre Rocha  2009-10-17 00:00:00         68         Brazil
6    Fernanda Ramos  2009-12-10 00:00:00         80         Brazil
7    Luís Gonçalves  2010-03-11 00:00:00         98         Brazil
8    Luís Gonçalves  2010-06-13 00:00:00        121         Brazil
9   Alexandre Rocha  2010-06-17 00:00:00        123         Brazil
10   Fernanda Ramos  2010-07-31 00:00:00        132         Brazil
11   Luís Gonçalves  2010-09-15 00:00:00        143         Brazil
12  Eduardo Martins  2010-11-14 00:00:00        154         Brazil
13  Roberto Almeida  2010-11-14 00:00:00        155         Brazil
14  Roberto Almeida  2010-12-25 00:00:00        166         Brazil
15  Eduardo Martins  2011-02-16 00:00:00        177         Brazil
16   Luís Gonçalves  2011-05-06 00:00:00        195         Brazil
17  Eduardo Martins  2011-05-21 00:00:00        199         Brazil
18  Roberto Almeida  2011-08-25 00:00:00        221         Brazil
19  Eduardo Martins  2012-01-09 00:00:00        251         Brazil
20  Alexandre Rocha  2012-01-22 00:00:00        252         Brazil
21   Fernanda Ramos  2012-01-22 00:00:00        253         Brazil
22   Fernanda Ramos  2012-03-03 00:00:00        264         Brazil
23  Alexandre Rocha  2012-04-25 00:00:00        275         Brazil
24  Alexandre Rocha  2012-07-28 00:00:00        297         Brazil
25   Luís Gonçalves  2012-10-27 00:00:00        316         Brazil
26   Fernanda Ramos  2012-11-01 00:00:00        319         Brazil
27   Luís Gonçalves  2012-12-07 00:00:00        327         Brazil
28  Alexandre Rocha  2013-03-18 00:00:00        349         Brazil
29  Roberto Almeida  2013-03-31 00:00:00        350         Brazil
30  Eduardo Martins  2013-07-02 00:00:00        372         Brazil
31  Roberto Almeida  2013-07-03 00:00:00        373         Brazil
32   Luís Gonçalves  2013-08-07 00:00:00        382         Brazil
33  Eduardo Martins  2013-08-12 00:00:00        383         Brazil
34  Roberto Almeida  2013-10-05 00:00:00        395         Brazil

In [12]:
# Obtén cada factura asociada a cada agente de ventas con su nombre completo

query= '''
SELECT e.FirstName, e.LastName, i.invoiceId FROM employees AS e
INNER JOIN customers As c
ON e.EmployeeId  = c.SupportRepId
INNER JOIN invoices AS i
ON C.CustomerId = i.CustomerId
WHERE e.title = "Sales Support Agent" or title = "Sales Manager"
'''

sql_query(query)

    FirstName LastName  InvoiceId
0        Jane  Peacock         98
1        Jane  Peacock        121
2        Jane  Peacock        143
3        Jane  Peacock        195
4        Jane  Peacock        316
..        ...      ...        ...
407     Steve  Johnson         88
408     Steve  Johnson        217
409     Steve  Johnson        240
410     Steve  Johnson        262
411     Steve  Johnson        314

[412 rows x 3 columns]

In [57]:
# obtén el nombre del cliente, el país, el nombre del agente y el total
query= '''
SELECT e.FirstName, e.LastName, c.FirstName, c.LastName, c.Country, i.total  FROM customers AS c
INNER JOIN employees As e
ON e.EmployeeId  = c.SupportRepId
INNER JOIN invoices AS i
ON C.CustomerId = i.CustomerId
'''

sql_query(query)

    FirstName LastName FirstName    LastName Country  Total
0        Jane  Peacock      Luís   Gonçalves  Brazil   3.98
1        Jane  Peacock      Luís   Gonçalves  Brazil   3.96
2        Jane  Peacock      Luís   Gonçalves  Brazil   5.94
3        Jane  Peacock      Luís   Gonçalves  Brazil   0.99
4        Jane  Peacock      Luís   Gonçalves  Brazil   1.98
..        ...      ...       ...         ...     ...    ...
407      Jane  Peacock      Puja  Srivastava   India   5.94
408      Jane  Peacock      Puja  Srivastava   India   1.99
409      Jane  Peacock      Puja  Srivastava   India   1.98
410      Jane  Peacock      Puja  Srivastava   India  13.86
411      Jane  Peacock      Puja  Srivastava   India   8.91

[412 rows x 6 columns]

In [9]:
# Obtén cada artículo de la factura con el nombre de la canción
query = ''' 
SELECT i.InvoiceLineId, t.Name FROM invoice_items AS i
INNER JOIN tracks As t 
ON i.trackId = t.trackId
'''

sql_query(query)

      InvoiceLineId                                               Name
0               579            For Those About To Rock (We Salute You)
1                 1                                  Balls to the Wall
2              1154                                  Balls to the Wall
3              1728                                    Fast As a Shark
4                 2                                  Restless and Wild
...             ...                                                ...
2235           1726  Symphony No. 2, Op. 16 -  "The Four Temperamen...
2236            577    Étude 1, In C Major - Preludio (Presto) - Liszt
2237           1153  Pini Di Roma (Pinien Von Rom) \ I Pini Della V...
2238            578  String Quartet No. 12 in C Minor, D. 703 "Quar...
2239           1727  String Quartet No. 12 in C Minor, D. 703 "Quar...

[2240 rows x 2 columns]

In [10]:
# Muestra todas las canciones con su nombre, formato, álbum y género
query= '''  SELECT t.Name AS cancion, a.Title AS album, g.Name AS género, 
m.Name AS formato FROM tracks t
INNER JOIN albums AS a ON a.AlbumId = t.AlbumId
INNER JOIN genres AS g ON g.GenreId = t.GenreId
INNER JOIN media_types AS m ON m.MediaTypeId = t.MediaTypeId
'''
sql_query(query)

,cancion,album,género,formato
0,For Those About To Rock (We Salute You),For Those About To Rock We Salute You,Rock,MPEG audio file
1,Balls to the Wall,Balls to the Wall,Rock,Protected AAC audio file
2,Fast As a Shark,Restless and Wild,Rock,Protected AAC audio file
3,Restless and Wild,Restless and Wild,Rock,Protected AAC audio file
4,Princess of the Dawn,Restless and Wild,Rock,Protected AAC audio file
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Respighi:Pines of Rome,Classical,Protected AAC audio file
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Schubert: The Late String Quartets & String Qu...,Classical,Protected AAC audio file
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Monteverdi: L'Orfeo,Classical,Protected AAC audio file
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Mozart: Chamber Music,Classical,Protected AAC audio file
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Mozart Gala: Famous Arias,Opera,Protected AAC audio file

In [11]:
# Cuántas canciones hay en cada playlist
query= ''' 
SELECT COUNT(TrackId), Name AS playlists
FROM playlist_track
INNER JOIN playlists ON playlist_track.PlaylistId = playlists.PlaylistId 
GROUP BY Name
'''
sql_query(query)

    COUNT(TrackId)                   playlists
0             1477                  90’s Music
1               39             Brazilian Music
2               75                   Classical
3               25   Classical 101 - Deep Cuts
4               25  Classical 101 - Next Steps
5               25  Classical 101 - The Basics
6               15                      Grunge
7               26         Heavy Metal Classic
8             6580                       Music
9                1                Music Videos
10               1                 On-The-Go 1
11             426                    TV Shows

In [13]:
# Cuánto ha vendido cada empleado
query = ''' 
SELECT SUM(i.Total), e.FirstName FROM Employees e
INNER JOIN customers c ON c.SupportRepId = e.EmployeeId
INNER JOIN invoices i ON i.CustomerId = c.CustomerId
GROUP BY e.FirstName
'''

sql_query(query)

   SUM(i.Total) FirstName
0        833.04      Jane
1        775.40  Margaret
2        720.16     Steve

In [ ]:
# ¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [ ]:
# ¿Cuáles son los 3 grupos que más han vendido?